Merge branch 'chore/improve-doc-and-ci' into 'main'
开源文档和ci优化

See merge request infini-open/rlark!89
